README.org
#+TITLE: Org file for dotfiles
#+AUTHOR: Anishka Patel
#+CREATED-ON: [2022-08-17 Wed]
#+LAST-MODIFIED: [2022-08-28 Sun]
#+DESCRIPTION: A detailed explanation for creation and usage of my dotfiles.

* Bash Config
Click below to take a look:
[[file:.bashrc][.bashrc file]]

Generated by the code below:
#+BEGIN_SRC bash

ln ~/.bashrc
#+END_SRC
* Zsh Config
Click below to take a look:
[[file:.zshrc][.zshrc file]]

Generated by the code below:
#+BEGIN_SRC bash
ln ~/.zshrc
#+END_SRC
* Vim Config
Click below to take a look:
[[file:.vimrc][.vimrc file]]

Generate by the code below:
#+BEGIN_SRC bash
ln ~/.vimrc
#+END_SRC
* LunarVim config
LunarVim - Distribution for neovim with advanced IDE like features i.e. lsp, auto-completion, code suggestion, etc.
** Install - [[https://github.com/LunarVim/LunarVim][GitHub - LunarVim]]
#+BEGIN_SRC bash
bash <(curl -s https://raw.githubusercontent.com/lunarvim/lunarvim/master/utils/installer/install.sh)
#+END_SRC
** Docs Link -  [[https://www.lunarvim.org/#opinionated][Introduction | LunarVim Docs]]
** Notes :
1. LunarVim(lvim) dose not over rides or removes previous nvim configurations.
2. lvim binary located at ~"~/.local/bin/lvim"~
3. Plugins are added to ~plugin~ section in ~config.lua~ file.
4. Config file is located at ~"~/.config/lvim/config.lua"~.
5. Some plugins require modifying ~init.lua~ file at ~"~/.local/share/lunarvim/lvim/init.lua"~
6. Imp commands -
   - ~:LSPInstall~
   - ~:TSInstall~
   - ~:PackerSync~
   - ~:LvimUpdate~
* AstroNvim config
AstroNvim - Another more advanced (than LunarVim) distribution for neovim with IDE like features.
** Requirements
- Neovim 0.7+
- Nerd Fonts
- Terminal w/ true color
- Optional:
  - ripgrep
  - lazygit
  - NCDU
  - Htop
  - python
  - node
** Install - [[https://github.com/AstroNvim/AstroNvim][GitHub - AstroNvim]]
#+BEGIN_SRC bash
git clone https://github.com/AstroNvim/AstroNvim ~/.config/nvim
nvim +PackerSync
#+END_SRC
** Docs Link - [[https://astronvim.github.io/][Getting Started | AstroNvim]]
** Notes
- AstroNvim(nvim) does remove pervious nvim configurations.
- nvim binary located at ~"/usr/bin/nvim"~
- Plugins are added to ~plugin~ section in ~"~/.config/nvim/lua/user/init.lua"~
- Some plugins require modifying ~init.lua~ file at ~"~/.config/nvim/init.lua"~
- Imp commands
  - ~:LspInstall~
  - ~:TSInstall~
  - ~:PackerSync~
  - ~:AstroUpdate~

* DoomEmacs config
** Requirements
** Install
** Notes
* Gesture config
Configuration for ~Gestures~ Application.
~Gestures~ application binds various keyboard shortcuts to touchpad genstures.
** Install ~Gestures~ application
#+BEGIN_SRC bash
sudo pacman -Syu community/gestures
#+END_SRC
** Configuration
Files stored as ~"~/.config/libinput-gestures.conf"~
Link to file: [[file:.config/libinput-gestures.conf][Gestures config file.]]

* Pacman packages
Pacman: Package installer for Arch Linux
** List generated
1. Explcitly installed packages
   Link to file: [[file:pacman-packages-list.txt][Pacman-Packages-List]]
   Created with command:
   #+BEGIN_SRC bash
   pacman -Qqe > pacman-packages-list.txt
   #+END_SRC
2. All packages
   Link to file: [[file:pacman-packages-list-full.txt][Pacman-Full-Packages-List]]
   Created with command:
   #+BEGIN_SRC bash
   pacman -Qq > pacman-packages-list-full.txt
   #+END_SRC
3. Pacman option to remember for list generation:
   |--------+------------------------------------------------------|
   | Option | Action                                               |
   |--------+------------------------------------------------------|
   | -Q     | List all packages with version                       |
   | -q     | List all packages without version                    |
   | -e     | List all explicitly installed packages               |
   | -n     | List all packages omitting foreign packages like AUR |
   | -m     | List all foreign packages                            |
   |--------+------------------------------------------------------|
4. Examples
   #+BEGIN_SRC bash
    pacman -Qqen
   #+END_SRC
5. Link for reference: [[https://wiki.archlinux.org/title/pacman/Tips_and_tricks#List_of_installed_packages][Pacman/Tips and tricks - ArchWiki]]
* Pip global packages
Pip: Package install for python
Link to file: [[file:pip-packages-list.txt][pip-packages-list]]
#+BEGIN_SRC bash
pip freeze | awk '{print $1}' > pip-packages-list.txt
#+END_SRC
* Npm global packages
Npm: Node package manager
Link to file: [[file:npm-packages-list.txt][npm-packages-list]]
 #+BEGIN_SRC bash
 npm -g list | awk '{print $2}' | awk -F '@' '{print $1}' > npm-packages-list.txt
 #+END_SRC
* Exported config files
** Global Shortcut file for KDE
[[file:exports/ani-kde-scheme.kksrc][kde-shortcuts]]
** Shourtcut file for Kate text editor
[[file:exports/kate-scheme.shortcuts][kate-shortcuts]]
** Shortuct file for Kwrite text editor
[[file:exports/kwrite-scheme.shortcuts][kwrite-shortcuts]]
