README.md

# Table of Contents

1.  [Bash Config](#org0ba32b4)
2.  [Zsh Config](#orgbbf78af)
3.  [Vim Config](#org590f74f)
4.  [LunarVim config](#org43e1ff9)
    1.  [Install - GitHub - LunarVim](#orgfa1351e)
    2.  [Docs Link -  Introduction | LunarVim Docs](#org4c589fb)
    3.  [Notes :](#orgdef233b)
5.  [AstroNvim config](#org1e63c9d)
    1.  [Requirements](#orgf8b1afb)
    2.  [Install - GitHub - AstroNvim](#orgfcb8f56)
    3.  [Docs Link - Getting Started | AstroNvim](#orgb24ae7e)
    4.  [Notes](#orgbc88b2c)
6.  [DoomEmacs config](#org5554d9d)
    1.  [Requirements](#org17b5201)
    2.  [Install](#orgfff2b01)
    3.  [Notes](#org0273cdb)
7.  [Gesture config](#orgd6ebc72)
    1.  [Install `Gestures` application](#org98b1047)
    2.  [Configuration](#org960b601)
8.  [Pacman packages](#org14090e7)
    1.  [List generated](#org3beb306)
9.  [Pip global packages](#org2249e66)
10. [Npm global packages](#orgc098ec8)
11. [Exported config files](#org20c5d58)
    1.  [Global Shortcut file for KDE](#org6fbc7ca)
    2.  [Shourtcut file for Kate text editor](#org564e9bd)
    3.  [Shortuct file for Kwrite text editor](#org1fff79e)



<a id="org0ba32b4"></a>

# Bash Config

Click below to take a look:
[.bashrc file](.bashrc)

Generated by the code below:

    
    ln ~/.bashrc


<a id="orgbbf78af"></a>

# Zsh Config

Click below to take a look:
[.zshrc file](.zshrc)

Generated by the code below:

    ln ~/.zshrc


<a id="org590f74f"></a>

# Vim Config

Click below to take a look:
[.vimrc file](.vimrc)

Generate by the code below:

    ln ~/.vimrc


<a id="org43e1ff9"></a>

# LunarVim config

LunarVim - Distribution for neovim with advanced IDE like features i.e. lsp, auto-completion, code suggestion, etc.


<a id="orgfa1351e"></a>

## Install - [GitHub - LunarVim](https://github.com/LunarVim/LunarVim)

    bash <(curl -s https://raw.githubusercontent.com/lunarvim/lunarvim/master/utils/installer/install.sh)


<a id="org4c589fb"></a>

## Docs Link -  [Introduction | LunarVim Docs](https://www.lunarvim.org/#opinionated)


<a id="orgdef233b"></a>

## Notes :

1.  LunarVim(lvim) dose not over rides or removes previous nvim configurations.
2.  lvim binary located at `"~/.local/bin/lvim"`
3.  Plugins are added to `plugin` section in `config.lua` file.
4.  Config file is located at `"~/.config/lvim/config.lua"`.
5.  Some plugins require modifying `init.lua` file at `"~/.local/share/lunarvim/lvim/init.lua"`
6.  Imp commands -
    -   `:LSPInstall`
    -   `:TSInstall`
    -   `:PackerSync`
    -   `:LvimUpdate`


<a id="org1e63c9d"></a>

# AstroNvim config

AstroNvim - Another more advanced (than LunarVim) distribution for neovim with IDE like features.


<a id="orgf8b1afb"></a>

## Requirements

-   Neovim 0.7+
-   Nerd Fonts
-   Terminal w/ true color
-   Optional:
    -   ripgrep
    -   lazygit
    -   NCDU
    -   Htop
    -   python
    -   node


<a id="orgfcb8f56"></a>

## Install - [GitHub - AstroNvim](https://github.com/AstroNvim/AstroNvim)

    git clone https://github.com/AstroNvim/AstroNvim ~/.config/nvim
    nvim +PackerSync


<a id="orgb24ae7e"></a>

## Docs Link - [Getting Started | AstroNvim](https://astronvim.github.io/)


<a id="orgbc88b2c"></a>

## Notes

-   AstroNvim(nvim) does remove pervious nvim configurations.
-   nvim binary located at `"/usr/bin/nvim"`
-   Plugins are added to `plugin` section in `"~/.config/nvim/lua/user/init.lua"`
-   Some plugins require modifying `init.lua` file at `"~/.config/nvim/init.lua"`
-   Imp commands
    -   `:LspInstall`
    -   `:TSInstall`
    -   `:PackerSync`
    -   `:AstroUpdate`


<a id="org5554d9d"></a>

# DoomEmacs config


<a id="org17b5201"></a>

## Requirements


<a id="orgfff2b01"></a>

## Install


<a id="org0273cdb"></a>

## Notes


<a id="orgd6ebc72"></a>

# Gesture config

Configuration for `Gestures` Application.
`Gestures` application binds various keyboard shortcuts to touchpad genstures.


<a id="org98b1047"></a>

## Install `Gestures` application

    sudo pacman -Syu community/gestures


<a id="org960b601"></a>

## Configuration

Files stored as `"~/.config/libinput-gestures.conf"`
Link to file: [Gestures config file.](.config/libinput-gestures.conf)


<a id="org14090e7"></a>

# Pacman packages

Pacman: Package installer for Arch Linux


<a id="org3beb306"></a>

## List generated

1.  Explcitly installed packages
    Link to file: [Pacman-Packages-List](pacman-packages-list.txt)
    Created with command:
    
        pacman -Qqe > pacman-packages-list.txt
2.  All packages
    Link to file: [Pacman-Full-Packages-List](pacman-packages-list-full.txt)
    Created with command:
    
        pacman -Qq > pacman-packages-list-full.txt
3.  Pacman option to remember for list generation:
    
    <table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
    
    
    <colgroup>
    <col  class="org-left" />
    
    <col  class="org-left" />
    </colgroup>
    <thead>
    <tr>
    <th scope="col" class="org-left">Option</th>
    <th scope="col" class="org-left">Action</th>
    </tr>
    </thead>
    
    <tbody>
    <tr>
    <td class="org-left">-Q</td>
    <td class="org-left">List all packages with version</td>
    </tr>
    
    
    <tr>
    <td class="org-left">-q</td>
    <td class="org-left">List all packages without version</td>
    </tr>
    
    
    <tr>
    <td class="org-left">-e</td>
    <td class="org-left">List all explicitly installed packages</td>
    </tr>
    
    
    <tr>
    <td class="org-left">-n</td>
    <td class="org-left">List all packages omitting foreign packages like AUR</td>
    </tr>
    
    
    <tr>
    <td class="org-left">-m</td>
    <td class="org-left">List all foreign packages</td>
    </tr>
    </tbody>
    </table>
4.  Examples
    
        pacman -Qqen
5.  Link for reference: [Pacman/Tips and tricks - ArchWiki](https://wiki.archlinux.org/title/pacman/Tips_and_tricks#List_of_installed_packages)


<a id="org2249e66"></a>

# Pip global packages

Pip: Package install for python
Link to file: [pip-packages-list](pip-packages-list.txt)

    pip freeze | awk '{print $1}' > pip-packages-list.txt


<a id="orgc098ec8"></a>

# Npm global packages

Npm: Node package manager
Link to file: [npm-packages-list](npm-packages-list.txt)

    npm -g list | awk '{print $2}' | awk -F '@' '{print $1}' > npm-packages-list.txt


<a id="org20c5d58"></a>

# Exported config files


<a id="org6fbc7ca"></a>

## Global Shortcut file for KDE

[kde-shortcuts](exports/ani-kde-scheme.kksrc)


<a id="org564e9bd"></a>

## Shourtcut file for Kate text editor

[kate-shortcuts](exports/kate-scheme.shortcuts)


<a id="org1fff79e"></a>

## Shortuct file for Kwrite text editor

[kwrite-shortcuts](exports/kwrite-scheme.shortcuts)

